module Localization
Views = {
    :abttest          => "テストは、ソフトウェア製品が開発されている内のエラー/バグ/欠陥がないことを実証するために行われ
  
  すべてではないナンバー！これは意味を伝えるための一つの方法ですが、それはから私たちを奪う
  テストの主な目的
  
  テストでは、欠陥を検出するプロセスです...任意のテスターの目的はにあるべき
  コードをクラックするために彼の最善を尽くしています。これで指を指しているか、開発者と障害を見つける破壊活動として見られるべきではありません。彼らはテスト中に発見された欠陥を最大限に活用できるように、実際には、テストは開発者コミュニティへの健康なフィードバックメカニズムとして考慮されるべきで、それらを分析し、根本原因を見つける＆適切な予防メカニズムを考案する。実際には、テスト中に発見された欠陥は、コードの品質を向上させることができます！
  
  テスターは、システムが動作するという仮定の下で働くことはありません！ソフトウェア製品は、エラーを見つけることを意図してテストする必要があります。ソフトウェアの欠陥を明らかにし、実行時のテストでは、成功を収めています。テストは、それ自体では、ソフトウェア製品の品質は向上しませんが、それは品質の指標である。むしろそのテストを考慮
  SDLCの分離相として、それは各＆すべての段階に統合されている活動であるべきである。意図が分析＆テスト、デザイン＆テスト、開発＆テストし、不具合を修正しました＆もっとテストする必要があります...！"
}
end