module Localization
Views = {
    :abttest          => "Тестирање је урађено да се покаже да постоје грешке / бугс / недостаци у софтверски производ који се развио
 
  Не, не уопште! Иако је ово један од начина преношења значења, то нам одузима
 Главни циљ тестирања
 
  Тестирање је процес откривања грешака ...Циљ сваког тестер би требало да буде
  покушавају себе да пуца код. Ово не треба посматрати као деструктивне активности која указује прстом на грешке или пронаћи са програмерима. У ствари, тестирање треба сматрати здравом механизам повратних информација на програмера заједници, тако да они могу максимално да искористе грешке установљене током тестирања, анализирати их, наћи узрок и осмислити одговарајуће превентивне механизме. Заправо, недостаци пронађени током тестирања помаже побољшању квалитета кода!
 
 Испитивач не би требало да раде под претпоставком да систем функционише!Софтверски производ треба да буде тестиран са намером проналажења грешке.Тест који открива када је погубљен дефект у софтверу, је успех. Иако тестирање, само по себи, не побољша квалитет софтверског производа, то је показатељ квалитета. Уместо да, с обзиром Тестирање
  као посебна фаза у СДЛЦ, она би требало да буде активност која је интегрисана у сваки и свака фаза.Намера треба да се анализирају и тестирање, дизајн и тест, Развој и тестирање, Фик недостаци и тестирајте више ...!!"
}
end