module Localization
Views = {
    :abttest          => "시험은 소프트웨어 제품이 개발되고의 오류 / 버그 / 결함이 더가 없다는 것을 입증하기위한 것입니다
 
  전혀 아냐, 그렇지 않아! 이 의미를 전달하는 방법 중 하나입니다 있지만, 그것은 우리를 멀어 질
  테스트의 주요 목적
 
  테스트 결함 잠복하는 과정입니다 ... 모든 시험기의 목적은에 있어야합니다
  코드를 해독하기 위해 최선을 시도해보십시오. 이것은에서 손가락을 가리키는 또는 개발자들과 결함을 찾아 파괴 활동으로 볼 수 없습니다. 사람들이 테스트 기간 동안 발견 된 결함의 최대 활용 할 수 있도록 사실, 테스트는 개발자 커뮤니티에 건강한 피드백 메커니즘으로 간주되어야한다, 그들을 분석 근본 원인을 찾을 수 및 적절한 예방 메커니즘을 고안. 사실, 테스트 기간 동안 발견 된 결함은 코드의 품질을 개선하는 데 도움이!
 
 테스터는 시스템이 작동하는 가정에서 작동하지 않는다!소프트웨어 제품은 오류를 찾는 목적으로 테스트해야합니다. 소프트웨어의 결함을 드러내는 수행 할 때 테스트, 성공입니다. 시험은 자체, 소프트웨어 제품의 품질을 향상되지 않습니다 있지만, 그것은 품질의 지표입니다. 오히려 그 시험을 고려
 SDLC에서 별도의 단계로, 각각의 및 모든 단계에 통합되어 활동을해야합니다.목적은 분석 및 테스트, 디자인 및 테스트, 개발 및 테스트, 결함 수정 및 기타 테스트하는 것입니다 ...!!"
}
end