module Localization
Views = {
    :abttest          => "אבחון נעשה כדי להוכיח שאין טעויות / הבאגים / פגמים שבמפתחים מוצר התוכנה
 
  לא, בכלל לא! למרות שזו אחת דרכים של העברת המשמעות, זה לוקח אותנו הרחק
 המטרה העיקרית של בדיקות
 
  בדיקה היא התהליך של חשיפת ליקויים ...המטרה של כל בוחן צריכה להיות
  תנסה כמיטב יכולתו לפצח את הקוד. זה לא צריך להיראות כפעילות הרסנית שמצביעה באצבעות או למצוא פגמים במפתחים. למעשה, בדיקה צריכה להיחשב כמנגנון משוב בריא לקהילת המפתחים, כך שהם יכולים לעשות שימוש מרבי של הליקויים שנמצאו במהלך בדיקות, לנתח אותם, למצוא את שורש הבעיה ולגבש מנגנוני מניעה מתאימים. למעשה, את הליקויים שנמצאו במהלך הבדיקה מסייעים לשיפור איכות הקוד!
 
 בוחן לא אמור לעבוד בהנחה שהמערכת עובדת!מוצר התוכנה שיש לבדוק עם הכוונה של מציאת שגיאות.הבדיקה, שבוצע כאשר מגלה פגם בתוכנה, היא הצלחה. למרות בדיקה, על ידי עצמו, אינה משפר את איכות מוצר התוכנה, זה הוא אינדיקטור של האיכות. אלא ששוקל בדיקה
 כשלב נפרד בSDLC, זה צריך להיות פעילות שמשתלבת בכל & כל שלב.הכוונה צריכה להיות לניתוח ובדיקה, עיצוב ובדיקה, פיתוח ובדיקות, לתקן פגמים ובדקו יותר ...!"
}
end