module Localization
Views = {
    :abttest          => "ويتم اختبار لإثبات أنه لا توجد أخطاء / البق / العيوب التي يجري وضعها في منتج البرنامج
 
  لا، ليس على الإطلاق!! وإن كان هذا هو أحد السبل لنقل المعنى، كان يأخذنا بعيدا عن
  والهدف الرئيسي من اختبار
 
  الاختبار هو عملية الكشف عن عيوب ... يجب أن يكون الهدف من أي اختبار هو
  حاول قصارى جهده لكسر الشفرة. هذا لا ينبغي أن ينظر إليه على أنه نشاط هدام الذي يشير بأصابع الاتهام إلى أو العثور على أخطاء مع المطورين. في الواقع، ينبغي النظر في اختبار التقييم كآلية صحية لمجتمع المطورين حتى يتمكنوا من الاستفادة القصوى من العيوب التي عثر عليها أثناء الاختبار، وتحليلها، والعثور على السبب الجذري ووضع آليات وقائية ملائمة. في الواقع، وجدت العيوب أثناء الاختبار يساعد تحسين نوعية رمز!
 
  وينبغي أن يكون اختبار أبدا العمل تحت افتراض أن النظام يعمل! وينبغي اختبار منتج البرنامج بقصد إيجاد الأخطاء. اختبار، والتي عند تنفيذ يكشف عن عيب في البرنامج، هو النجاح. على الرغم من الاختبار، في حد ذاته، لا يحسن جودة المنتج والبرمجيات، وهو مؤشر على جودة. أنه بدلا النظر اختبار
  كمرحلة منفصلة في SDLC، ينبغي أن يكون نشاط والتي تتكامل في كل مرحلة وكل. ينبغي أن القصد من ذلك هو اختبار تحليل و، تصميم واختبار وتطوير واختبار، وإصلاح العيوب واختبار أكثر ...!"
}
end